src/cf/Documents/уатВзаимозачет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатВзаимозачет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>InformationRegister.уатДатыПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.уатРасчетыПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дебитор</Name>
					<Comment>Контрагент, который имеет долги перед нами</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Comment>Контрагент, которому мы должны</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мультивалютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Договора и сделки по которым выполняется взаимозачет</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорДебитора</Name>
							<Comment>Договор взаиморасчетов дебитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКредитора</Name>
							<Comment>Договор взаиморасчетов кредитора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаДебитора</Name>
							<Comment>Сделка, по которой дебитор должен нам</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаКредитора</Name>
							<Comment>Сделка, по которой мы должны кредитору</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсДебитора</Name>
							<Comment>Курс валюты договора дебитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьДебитора</Name>
							<Comment>Кратность валюты договора дебитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсКредитора</Name>
							<Comment>Курс валюты договора кредитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьКредитора</Name>
							<Comment>Кратность валюты договора кредитора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДебитора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКредитора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДебитора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКредитора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатРасчетыПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатРасчетыПоДокументам</Name>
			<Comment>Расчеты по документам (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Comment>Сумма увеличения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПриходУпр</Name>
					<Comment>Сумма увеличения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Comment>Сумма уменьшения долга в валюте взаиморасчетов с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходУпр</Name>
					<Comment>Сумма уменьшения долга в валюте управленческого учета с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПолучателиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Comment>Этап по графику оплаты из договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатВзаимозачет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатВзаимозачет.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение_проф.ОтразитьРасчетыПоЗаказамНаТС(ДополнительныеСвойства, Движения, Отказ);
		
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатВзаимозачет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатВзаимозачет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	Если Мультивалютный Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВалютаДокумента"));
	КонецЕсли;
		
	Для Каждого ТекСтрока Из Состав Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СделкаДебитора) И (ТекСтрока.ДоговорДебитора.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ТекСтрока.ДоговорДебитора.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
			СтрокаСообщения = "В строке " + ТекСтрока.НомерСтроки + " табличной части ""Состав"" не указано значение сделки дебитора!";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СделкаКредитора) И (ТекСтрока.ДоговорКредитора.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ТекСтрока.ДоговорКредитора.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам) Тогда
			СтрокаСообщения = "В строке " + ТекСтрока.НомерСтроки + " табличной части ""Состав"" не указано значение сделки кредитора!";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	ВалютаДокумента = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Организация);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И (Курс=0 ИЛИ Кратность=0) Тогда
		КурсКратностьДокумента = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, Дата, ЭтотОбъект);
		Курс      = КурсКратностьДокумента.Курс;
		Кратность = КурсКратностьДокумента.Кратность;
	КонецЕсли;
	
	// пересчет суммы документа
	РасчитатьСуммуДокумента();
	
	// При отмене проведения нужно обновить состояние оплаты по заказам, но информации по заказам в самом документе нет,
	// поэтому заказы запоминаем здесь.
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		//НЗуатРасчетыПоДокументам = РегистрыНакопления.уатРасчетыПоДокументам.СоздатьНаборЗаписей();
		//НЗуатРасчетыПоДокументам.Отбор.Регистратор.Установить(Ссылка);
		//НЗуатРасчетыПоДокументам.Прочитать();
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	уатРасчетыПоДокументам.ЗаказНаТС КАК ЗаказНаТС
		|ИЗ
		|	РегистрНакопления.уатРасчетыПоДокументам КАК уатРасчетыПоДокументам
		|ГДЕ
		|	уатРасчетыПоДокументам.Регистратор = &Регистратор");
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		тблЗаказы = Запрос.Выполнить().Выгрузить();
		ДополнительныеСвойства.Вставить("ЗакрытыеЗаказыНаТС", тблЗаказы.ВыгрузитьКолонку("ЗаказНаТС"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура РасчитатьСуммуДокумента()
	СуммаДокумента = 0;
	Для Каждого ТекСтрока Из Состав Цикл
		Если Мультивалютный Тогда
			ТекСумма = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаДебитора,
				ТекСтрока.ВалютаДебитора, ВалютаДокумента,
				ТекСтрока.КурсДебитора, Курс, ТекСтрока.КратностьДебитора, Кратность,,
				ЭтотОбъект);
		Иначе
			ТекСумма = ТекСтрока.СуммаДебитора;
		КонецЕсли;
		СуммаДокумента = СуммаДокумента + ТекСумма;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
